Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.0.32/atdf/PIC32CM6408MC00048.atdf
        <module name="NVMCTRL" id="03929" version="1a0">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="ECC_PRESENT" value="0" caption="define out all the added ECC logic - when =0 there shall be no ECC logic present in the design"/>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0XC0000007FFFFFFFF"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="RSTFFLTADDR" value="0" caption="the reset default for FFLTADDR"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0XC01FFFFFFFFFFFFF"/>
              <param name="DATAFLASH_PAGES" value="32"/>
              <param name="DATAFLASH_ROW_SIZE" value="256"/>
              <param name="DATAFLASH_ADDR" value="0x00400000" caption="Start address of the WWR EEPROM area"/>
              <param name="DATAFLASH_SIZE" value="2048" caption="Byte size of the WWR EEPROM area"/>
              <param name="FLASH_SIZE" value="65536"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="1024"/>
              <param name="PAGES_PR_REGION" value="64"/>
              <param name="ROW_SIZE" value="256"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for NVMCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2207" version="4.0.1.1">
          <instance name="FUSES">
            <register-group name="OTP5_FUSES" name-in-module="OTP5_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806030"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2119" version="2.1.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XOSC_CLK" function="XOSC" pad="PA10"/>
              <signal group="XOSC_EN" function="XOSC" pad="PA08"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_FDPLL" value="0" caption="Index of Generic Clock for DPLL"/>
              <param name="GCLK_ID_FDPLL32K" value="1" caption="Index of Generic Clock for DPLL 32K"/>
              <param name="FDPLL_VERSION" value="0x211"/>
              <param name="OSC48M_VERSION" value="0x101"/>
              <param name="XOSC_VERSION" value="0x201"/>
              <param name="INSTANCE_ID" value="4" caption="Instance index for OSCCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2246" version="2.1.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for OSC32KCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="1.1.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="HPB_NUM" value="3" caption="Number of bridges AHB/APB"/>
              <param name="INTFLAG_NUM" value="4" caption="Number of intflag registers"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for PAC"/>
            </parameters>
          </instance>
        </module>
        <module name="PDEC" id="U2263" version="1.0.0">
          <instance name="PDEC">
            <register-group name="PDEC" name-in-module="PDEC" address-space="base" offset="0x42006800"/>
            <signals>
              <signal group="QDI" index="0" function="J" pad="PA08"/>
              <signal group="QDI" index="0" function="G" pad="PA16"/>
              <signal group="QDI" index="1" function="J" pad="PA09"/>
              <signal group="QDI" index="1" function="G" pad="PA17"/>
              <signal group="QDI" index="2" function="J" pad="PA10"/>
              <signal group="QDI" index="2" function="G" pad="PA18"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare Channels units"/>
              <param name="GCLK_ID" value="34" caption="GCLK Index"/>
              <param name="INSTANCE_ID" value="90" caption="Instance index for PDEC"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="2.1.0">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="BIAS_RAM_HS" value="1" caption="one if RAM HS can be back biased"/>
              <param name="PD_NUM" value="0" caption="Number of switchable Power Domain"/>
              <param name="INSTANCE_ID" value="1" caption="Instance index for PM"/>
            </parameters>
          </instance>
        </module>
