Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.0.32/atdf/PIC32CM6408MC00048.atdf
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__EDGESEL">
        <value name="DISABLE" caption="Edge detector is disabled" value="0"/>
        <value name="ENABLE" caption="Edge detector is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL">
        <value name="MASK" caption="Masked input" value="0x0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="0x1"/>
        <value name="LINK" caption="Linked LUT input source" value="0x2"/>
        <value name="EVENT" caption="Event input source" value="0x3"/>
        <value name="IO" caption="I/O pin input source" value="0x4"/>
        <value name="AC" caption="AC input source" value="0x5"/>
        <value name="TC" caption="TC input source" value="0x6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="0x7"/>
        <value name="TCC" caption="TCC input source" value="0x8"/>
        <value name="SERCOM" caption="SERCOM input source" value="0x9"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INVEI">
        <value name="NORMAL" caption="Incoming event is not inverted" value="0"/>
        <value name="INVERTED" caption="Incoming event is inverted" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEI">
        <value name="DISABLE" caption="LUT incoming event is disabled" value="0"/>
        <value name="ENABLE" caption="LUT incoming event is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEO">
        <value name="DISABLE" caption="LUT event output is disabled" value="0"/>
        <value name="ENABLE" caption="LUT event output is enabled" value="1"/>
      </value-group>
    </module>
    <module name="DAC" id="U2214" version="2.0.1" caption="Digital Analog Converter">
      <register-group name="DAC" caption="Digital Analog Converter">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="EOEN" caption="External Output Enable" mask="0x1"/>
          <bitfield name="IOEN" caption="Internal Output Enable" mask="0x2"/>
          <bitfield name="LEFTADJ" caption="Left Adjusted Data" mask="0x4"/>
          <bitfield name="VPD" caption="Voltage Pump Disable" mask="0x8"/>
          <bitfield name="DITHER" caption="Dither Enable" mask="0x20"/>
          <bitfield name="REFSEL" caption="Reference Selection" mask="0xC0" values="DAC_CTRLB__REFSEL"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="STARTEI" caption="Start Conversion Event Input" mask="0x1"/>
          <bitfield name="EMPTYEO" caption="Data Buffer Empty Event Output" mask="0x2"/>
          <bitfield name="INVEI" caption="Invert Event Input" mask="0x4"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EMPTY" caption="Data Buffer Empty Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EMPTY" caption="Data Buffer Empty Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="UNDERRUN" caption="Underrun" mask="0x1"/>
          <bitfield name="EMPTY" caption="Data Buffer Empty" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY" caption="DAC Ready" mask="0x1"/>
        </register>
        <register name="DATA" offset="0x8" rw="W" access="WSYNC" size="2" initval="0x0000" caption="Data">
          <bitfield name="DATA" caption="Data value to be converted" mask="0xFFFF"/>
        </register>
        <register name="DATABUF" offset="0xC" rw="W" access="WSYNC" size="2" initval="0x0000" caption="Data Buffer">
          <bitfield name="DATABUF" caption="Data Buffer" mask="0xFFFF"/>
        </register>
        <register name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="DAC Enable Status" mask="0x2"/>
          <bitfield name="DATA" caption="Data" mask="0x4"/>
          <bitfield name="DATABUF" caption="Data Buffer" mask="0x8"/>
        </register>
        <register name="DBGCTRL" offset="0x14" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="DAC_CTRLB__REFSEL">
        <value name="INTREF" caption="Internal Voltage Reference" value="0"/>
        <value name="VDDANA" caption="Analog Voltage Supply" value="1"/>
        <value name="VREFA" caption="External Voltage Reference A (shared with ADC)" value="2"/>
      </value-group>
    </module>
    <module name="DIVAS" id="U2258" version="1.0.0" caption="Divide and Square Root Accelerator">
      <register-group name="DIVAS" caption="Divide and Square Root Accelerator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SIGNED" caption="Signed" mask="0x1"/>
          <bitfield name="DLZ" caption="Disable Leading Zero Optimization" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x4" rw="RW" size="1" initval="0x00" caption="Status">
          <bitfield name="BUSY" caption="DIVAS Accelerator Busy" mask="0x1"/>
          <bitfield name="DBZ" caption="Writing a one to this bit clears DBZ to zero" mask="0x2"/>
        </register>
