Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.0.32/atdf/PIC32CM6408MC00048.atdf
      <register-group name="OTP2_FUSES">
        <register name="OTP2_WORD_1" offset="0x4" rw="R" size="4" caption="OTP2 Page Word 1">
          <bitfield name="NVMCTRL_ECCDIS_NOTPRESENT" caption="Allows the ECC disable bit (ECCCTRL.ECCDIS) to become not available for the user with a device fuse." mask="0x10000"/>
          <bitfield name="NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT" caption="Allows the ECC Data Flash disable bit (ECCCTRL.ECCDFDIS) to become not available for the user with a device fuse." mask="0x20000"/>
          <bitfield name="NVMCTRL_CEHL_NOTPRESENT" caption="Allows the CEHL bit to be able to be used by the user to Chip Erase Hard Lock or disabled and no Chip Erase Hard lock allowed." mask="0x40000"/>
        </register>
      </register-group>
      <register-group name="OTP3_FUSES">
        <register name="OTP3_WORD_1" offset="0x4" rw="R" size="4" caption="OTP3 Page Word 1">
          <bitfield name="NVMCTRL_DUMMY2" caption="Dummy for OTP3 entry" mask="0x80000000"/>
        </register>
      </register-group>
      <register-group name="OTP4_FUSES">
        <register name="OTP4_WORD_1" offset="0x4" rw="R" size="4" caption="OTP4 Page Word 1">
          <bitfield name="NVMCTRL_DUMMY" caption="Dummy for OTP4 entry" mask="0x80000000"/>
        </register>
      </register-group>
      <register-group name="OTP5_FUSES">
        <register name="OTP5_WORD_0" offset="0x0" rw="R" size="4" caption="OTP5 Page Word 0">
          <bitfield name="ADC0_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC0_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="ADC1_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x1C0"/>
          <bitfield name="ADC1_BIASCOMP" caption="ADC Comparator Scaling" mask="0xE00"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" size="4" rw="R" caption="TEMP_LOG Page Word 0">
          <bitfield name="TSENS_TCAL" caption="Temperature Calibration" mask="0x3F"/>
          <bitfield name="TSENS_FCAL" caption="Frequency Calibration" mask="0xFC0"/>
          <bitfield name="TSENS_GAIN_0" caption="Gain Calibration bits 19:0" mask="0xFFFFF000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" size="4" rw="R" caption="TEMP_LOG Page Word 1">
          <bitfield name="TSENS_GAIN_1" caption="Gain Calibration bits 23:20" mask="0xF"/>
          <bitfield name="TSENS_OFFSET" caption="Offse Calibration" mask="0xFFFFFF0"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" rw="RW" size="4" initval="0xFFFFFFFF" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0x7" values="USER_FUSES_NVMCTRL__BOOTPROT"/>
          <bitfield name="BODVDDUSERLEVEL" caption="BODVDD User Level" mask="0x3F00"/>
          <bitfield name="BODVDD_DIS" caption="BODVDD Disable" mask="0x4000" values="SUPC_BODVDD__DIS"/>
          <bitfield name="BODVDD_ACTION" caption="BODVDD Action" mask="0x18000" values="SUPC_BODVDD__ACTION"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000" values="WDT__ENABLE"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000" values="WDT__ALWAYSON"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000" values="WDT_CONFIG__PER"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFFFFFFF" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF" values="WDT_CONFIG__WINDOW"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0" values="WDT_EWCTRL__EWOFFSET"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100" values="WDT__WEN"/>
          <bitfield name="BODVDD_HYST" caption="BODVDD Hysterisis" mask="0x200" values="SUPC_BODVDD__HYST"/>
          <bitfield name="NVMCTRL_REGION_LOCKS" caption="NVM Region lock bits" mask="0xFFFF0000"/>
        </register>
      </register-group>
      <value-group name="USER_FUSES_NVMCTRL__BOOTPROT">
        <value name="SIZE_0BYTES" caption="0 Bytes" value="0x7"/>
        <value name="SIZE_512BYTES" caption="512 Bytes" value="0x6"/>
        <value name="SIZE_1024BYTES" caption="1024 Bytes" value="0x5"/>
        <value name="SIZE_2048BYTES" caption="2048 Bytes" value="0x4"/>
        <value name="SIZE_4096BYTES" caption="4096 Bytes" value="0x3"/>
        <value name="SIZE_8192BYTES" caption="8192 Bytes" value="0x2"/>
        <value name="SIZE_16384BYTES" caption="16384 Bytes" value="0x1"/>
        <value name="SIZE_32768BYTES" caption="32768 Bytes" value="0x0"/>
      </value-group>
      <value-group name="SUPC_BODVDD__DIS">
        <value name="ENABLED" caption="BODVDD is enabled on power on" value="0x0"/>
        <value name="DISABLED" caption="BODVDD is disabled on power on" value="0x1"/>
      </value-group>
      <value-group name="SUPC_BODVDD__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BODVDD generates a reset" value="0x1"/>
        <value name="INT" caption="The BODVDD generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="WDT__ENABLE">
        <value name="DISABLED" caption="WDT is disabled on power on" value="0x0"/>
        <value name="ENABLED" caption="WDT is enabled on power on" value="0x1"/>
      </value-group>
      <value-group name="WDT__ALWAYSON">
        <value name="DISABLED" caption="WDT is enabled and disabled through ENABLE bit" value="0x0"/>
        <value name="ENABLED" caption="WDT is enabled and can only be disabled by a power-on reset" value="0x1"/>
      </value-group>
      <value-group name="WDT_CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
