Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.0.32/atdf/PIC32CM6408MC00048.atdf
      <value-group name="OSCCTRL_OSC48MDIV__DIV">
        <value name="DIV1" caption="48 MHz" value="0"/>
        <value name="DIV2" caption="24 MHz" value="1"/>
        <value name="DIV3" caption="16 MHz" value="2"/>
        <value name="DIV4" caption="12 MHz" value="3"/>
        <value name="DIV5" caption="9.6 MHz" value="4"/>
        <value name="DIV6" caption="8 MHz" value="5"/>
        <value name="DIV7" caption="6.86 MHz" value="6"/>
        <value name="DIV8" caption="6 MHz" value="7"/>
        <value name="DIV9" caption="5.33 MHz" value="8"/>
        <value name="DIV10" caption="4.8 MHz" value="9"/>
        <value name="DIV11" caption="4.36 MHz" value="10"/>
        <value name="DIV12" caption="4 MHz" value="11"/>
        <value name="DIV13" caption="3.69 MHz" value="12"/>
        <value name="DIV14" caption="3.43 MHz" value="13"/>
        <value name="DIV15" caption="3.2 MHz" value="14"/>
        <value name="DIV16" caption="3 MHz" value="15"/>
      </value-group>
      <value-group name="OSCCTRL_OSC48MSTUP__STARTUP">
        <value name="CYCLE8" caption="166 ns" value="0"/>
        <value name="CYCLE16" caption="333 ns" value="1"/>
        <value name="CYCLE32" caption="667 ns" value="2"/>
        <value name="CYCLE64" caption="1.333 us" value="3"/>
        <value name="CYCLE128" caption="2.667 us" value="4"/>
        <value name="CYCLE256" caption="5.333 us" value="5"/>
        <value name="CYCLE512" caption="10.667 us" value="6"/>
        <value name="CYCLE1024" caption="21.333 us" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__LTIME">
        <value name="Default" caption="No time-out. Automatic lock" value="0"/>
        <value name="8MS" caption="Time-out if no lock within 8 ms" value="4"/>
        <value name="9MS" caption="Time-out if no lock within 9 ms" value="5"/>
        <value name="10MS" caption="Time-out if no lock within 10 ms" value="6"/>
        <value name="11MS" caption="Time-out if no lock within 11 ms" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__FILTER">
        <value name="Default" caption="Default Filter Mode" value="0"/>
        <value name="LBFILT" caption="Low Bandwidth Filter" value="1"/>
        <value name="HBFILT" caption="High Bandwidth Filter" value="2"/>
        <value name="HDFILT" caption="High Damping Filter" value="3"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__REFCLK">
        <value name="XOSC32K" caption="XOSC32K Clock Reference" value="0"/>
        <value name="XOSC" caption="XOSC Clock Reference" value="1"/>
        <value name="GCLK" caption="GCLK Clock Reference" value="2"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLPRESC__PRESC">
        <value name="DIV1" caption="DPLL output is divided by 1" value="0"/>
        <value name="DIV2" caption="DPLL output is divided by 2" value="1"/>
        <value name="DIV4" caption="DPLL output is divided by 4" value="2"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2246" version="2.1.0" caption="32k Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32k Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
          <bitfield name="CLKSW" caption="XOSC32K Clock switch" mask="0x8"/>
        </register>
        <register name="RTCCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="RTC Clock Selection">
          <bitfield name="RTCSEL" caption="RTC Clock Selection" mask="0x7" values="OSC32KCTRL_RTCCTRL__RTCSEL"/>
        </register>
        <register name="XOSC32K" offset="0x14" rw="RW" size="2" initval="0x0080" caption="32kHz External Crystal Oscillator (XOSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700" values="OSC32KCTRL_XOSC32K__STARTUP"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
        </register>
        <register name="CFDCTRL" offset="0x16" rw="RW" size="1" initval="0x00" caption="Clock Failure Detector Control">
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x1"/>
          <bitfield name="SWBACK" caption="Clock Switch Back Enable" mask="0x2"/>
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x4"/>
        </register>
        <register name="EVCTRL" offset="0x17" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1"/>
        </register>
