Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.0.32/atdf/PIC32CM6408MC00048.atdf
      <value-group name="SERCOM_USART_CTRLB__ENC">
        <value name="DISABLE" caption="Data is not encoded" value="0x0"/>
        <value name="IRDA" caption="Data is IrDA encoded" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__LINCMD">
        <value name="NONE" caption="Normal USART transmission" value="0x0"/>
        <value name="SOFTWARE_CONTROL_TRANSMIT_CMD" caption="Break field is transmitted when DATA is written" value="0x1"/>
        <value name="AUTO_TRANSMIT_CMD" caption="Break, sync and identifier are automatically transmitted when DATA is written with the identifier" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__PMODE">
        <value name="EVEN" caption="Even Parity" value="0x0"/>
        <value name="ODD" caption="Odd Parity" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__SBMODE">
        <value name="1_BIT" caption="One Stop Bit" value="0x0"/>
        <value name="2_BIT" caption="Two Stop Bits" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__BRKLEN">
        <value name="13_BIT" caption="Break field transmission is 13 bit times" value="0x0"/>
        <value name="17_BIT" caption="Break field transmission is 17 bit times" value="0x1"/>
        <value name="21_BIT" caption="Break field transmission is 21 bit times" value="0x2"/>
        <value name="26_BIT" caption="Break field transmission is 26 bit times" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__HDRDLY">
        <value name="DELAY0" caption="Delay between break and sync transmission is 1 bit time; Delay between sync and ID transmission is 1 bit time" value="0x0"/>
        <value name="DELAY1" caption="Delay between break and sync transmission is 4 bit time; Delay between sync and ID transmission is 4 bit time" value="0x1"/>
        <value name="DELAY2" caption="Delay between break and sync transmission is 8 bit time; Delay between sync and ID transmission is 4 bit time" value="0x2"/>
        <value name="DELAY3" caption="Delay between break and sync transmission is 14 bit time; Delay between sync and ID transmission is 4 bit time" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CM_STATUS__BUSSTATE">
        <value name="UNKNOWN" caption="Wait for stop or idle" value="0x0"/>
        <value name="IDLE" caption="Wait for transaction initialization" value="0x1"/>
        <value name="OWNER" caption="I2C master is the current owner of the bus" value="0x2"/>
        <value name="BUSY" caption="Some other I2C master owns the bus" value="0x3"/>
      </value-group>
    </module>
    <module name="SUPC" id="U2117" version="2.1.1" caption="Supply Controller">
      <register-group name="SUPC" caption="Supply Controller">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
        </register>
        <register name="BODVDD" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BODVDD Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18" values="SUPC_BODVDD__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="Configuration in Active mode" mask="0x100"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SUPC_BODVDD__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level for VDD" mask="0x3F0000"/>
        </register>
        <register name="VREG" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="VREG Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
        </register>
        <register name="VREF" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VREF Control">
          <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x2"/>
          <bitfield name="VREFOE" caption="Voltage Reference Output Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="SEL" caption="Voltage Reference Selection" mask="0xF0000" values="SUPC_VREF__SEL"/>
        </register>
      </register-group>
